

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостьюЭлементвоФормы()
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	УправлениеВидимостьюЭлементвоФормы()
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюЭлементвоФормы()
	
	ЭтоПосещениеАтракциона = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАтракциона);
	Элементы.ВидАтракциона.Видимость = ЭтоПосещениеАтракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАтракциона;
		
КонецПроцедуры

#КонецОбласти
