
#Область ПрограммныйИнтерфейс

// Нормализованный номер телефона.
// 
// Параметры:
// Телефон - Строка
// 
// Возвращаемое значение: Строка
//  
Функция НормализованныйНомерТелефона(Телефон,ВызыватьИсключение = Ложь) Экспорт
		
	Цифра = "0123456789";
	
	ЦифрыТелефона = "";
	
	Для Счетчик = 1 по СтрДлина(Телефон) Цикл
		
		Символ = Сред(Телефон,Счетчик,1);
		Если СтрНайти(Цифра,Символ) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЦифрыТелефона = ЦифрыТелефона + Символ;
				
	КонецЦикла;
	
	Если СтрНачинаетсяС(ЦифрыТелефона,"8" ) Тогда
		ЦифрыТелефона = "7"+Сред(ЦифрыТелефона,2);
	КонецЕсли;
	
	Ошибки = Новый Массив;
	
	Если Не СтрНачинаетсяС(ЦифрыТелефона, "7" ) Тогда
		Ошибки.Добавить("Первая цифра телефона должна быть 7 или 8");
	КонецЕсли;
	
	Если не СтрДлина(ЦифрыТелефона) = 11 Тогда
		Ошибки.Добавить("Номер телефона должен содержать 11 цифр");
	КонецЕсли;
	
	Если Ошибки.Количество()>0 Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение СтрСоединить(Ошибки, "; ");
		Иначе
			 Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЦифрыТелефона;
	

	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
