
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	СвойстваНоменклатуры = СвойстваНоменклатуры(Номенклатура);

	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Основание = Ссылка;
	Движение.ВидАтракциона = СвойстваНоменклатуры.ВидАтракциона;
	Движение.КоличествоПосещений = СвойстваНоменклатуры.КоличествоПосещений;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.ВидАтракциона = СвойстваНоменклатуры.ВидАтракциона;
	Движение.Клиент = Клиент;
	Движение.Основание = Ссылка;
	Движение.Сумма = СуммаДокумента;

	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МаксимальнаяДоля = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
	
	Если Скидка <> 0 Тогда
		Если Скидка > Цена Тогда
			Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Скидка не должна превышать цену";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Скидка";
		Сообщение.Сообщить();
		КонецЕсли;
		
		Если Цена <> 0 Тогда
			Доля = Скидка/Цена*100;
			Если Доля = Скидка/Цена*100 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Доля скидки больше допустимой (%1%)", МаксимальнаяДоля);
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = "Скидка";
			Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойстваНоменклатуры(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ВидАтракциона,
	|	Номенклатура.КоличествоПосещений
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура );
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ВидАтракциона", Выборка.ВидАтракциона);
	Результат.Вставить("КоличествоПосещений", Выборка.КоличествоПосещений );
	
	Возврат Результат;
КонецФункции
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
